In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("D:/ML/8-9-data-analysis/8-9-data-analysis/empdata.csv")
df

   empid           ename       sal         doj
0   1001      Ganesh Rao  10000.00  10-10-2000
1   1002      Anil Kumar  23000.50    3-3-2002
2   1003    Gaurav Gupta  18000.33    3-3-2002
3   1004    Hema Chandra  16500.50    3-3-2002
4   1005  Laxmi Prasanna  12000.75   10-8-2000
5   1006       Anant Nag   9999.99    9-9-1999

In [5]:
df1=df.loc[:,['empid','sal']]
df1

   empid       sal
0   1001  10000.00
1   1002  23000.50
2   1003  18000.33
3   1004  16500.50
4   1005  12000.75
5   1006   9999.99

In [6]:
df1=df.iloc[:,[0,2]]
df1

   empid       sal
0   1001  10000.00
1   1002  23000.50
2   1003  18000.33
3   1004  16500.50
4   1005  12000.75
5   1006   9999.99

In [7]:
df1=df.loc[0:3,['empid','sal']]
df1

   empid       sal
0   1001  10000.00
1   1002  23000.50
2   1003  18000.33
3   1004  16500.50

In [8]:
df1=df.loc[0:3,:]
df1

   empid         ename       sal         doj
0   1001    Ganesh Rao  10000.00  10-10-2000
1   1002    Anil Kumar  23000.50    3-3-2002
2   1003  Gaurav Gupta  18000.33    3-3-2002
3   1004  Hema Chandra  16500.50    3-3-2002

In [10]:
df1=df.iloc[0:3,:]
df1

   empid         ename       sal         doj
0   1001    Ganesh Rao  10000.00  10-10-2000
1   1002    Anil Kumar  23000.50    3-3-2002
2   1003  Gaurav Gupta  18000.33    3-3-2002

In [11]:
df1=df.loc[3:0:-1,:]
df1

   empid         ename       sal         doj
3   1004  Hema Chandra  16500.50    3-3-2002
2   1003  Gaurav Gupta  18000.33    3-3-2002
1   1002    Anil Kumar  23000.50    3-3-2002
0   1001    Ganesh Rao  10000.00  10-10-2000

In [12]:
df1=df.iloc[3:0:-1,:]
df1

   empid         ename       sal       doj
3   1004  Hema Chandra  16500.50  3-3-2002
2   1003  Gaurav Gupta  18000.33  3-3-2002
1   1002    Anil Kumar  23000.50  3-3-2002

In [14]:
df1=df.iloc[-1]
df1

empid         1006
ename    Anant Nag
sal        9999.99
doj       9-9-1999
Name: 5, dtype: object

In [4]:
df1=df.loc[:,'doj']
df1

0    10-10-2000
1      3-3-2002
2      3-3-2002
3      3-3-2002
4     10-8-2000
5      9-9-1999
Name: doj, dtype: object

In [6]:
df1=df.iloc[:,-1]
df1

0    10-10-2000
1      3-3-2002
2      3-3-2002
3      3-3-2002
4     10-8-2000
5      9-9-1999
Name: doj, dtype: object

In [ ]:
df=pd.read_csv("D:\ML\8-9-data-analysis\8-9-data-analysis/empdat")